

// 静流ーフォンツを使用。
// 使いそうな日本語をグーグル先生に伺い、トップ 1000 程をペンタブで書き殴ったゴリ押し＆悪あがきクラス。目的は達するからよし。
// 静流ーフォンツに無い文字は、「？」で描画される。デバッグ時にはこのまま残し、ゲームの完成時に足りない文字のみを補う。

#include "Karakuri.h"

// ここが最大の悪あがきとも言える。文字をもう、とにかく勢いで数字化。
// 細かいことはいい。やれ。＜しかしあれはまだ・・・＜今使わずにいつ使うのだ

namespace sizurus_fonts{
    
    enum ten_flags{
        dakuten,
        handakuten,
        none,
    };

enum SizurusFontsName{
    刊,圧,掲,捨,秘,札,導,九,麻,傷,濁点,歯,清,七,晴,晩,継,犯,辞,環,列,含,暗,剣,盾,腕,輪,貰,冬,州,稼,酔,
    賀,恵,測,乙,腐,牛,互,療,到,里,延,払,誘,旦,純,富,裕,綺,忙,箱,隠,嘘,嫁,蔵,敗,菅,尾,湯,妙,角,丁,監,
    ン,ー,鍵括弧始,鍵括弧閉,括弧始,括弧閉,歓,購,右,左,触,乱,仮,慢,百,推,那,堂,草,華,微,疑,陽,揺,責,快,景,劇,課,礼,財,耳,
    セ,ソ,タ,チ,ツ,テ,ト,ナ,ニ,ヌ,ネ,ノ,ハ,ヒ,フ,ヘ,ホ,マ,ミ,ム,メ,モ,ヤ,ユ,ヨ,ラ,リ,ル,レ,ロ,ワ,ヲ,
    み,む,め,も,や,ゆ,よ,ら,り,る,れ,ろ,わ,を,ん,波線,吃驚,疑問,句点,ア,イ,ウ,エ,オ,カ,キ,ク,ケ,コ,サ,シ,ス,
    歴,あ,い,う,え,お,た,ち,つ,て,と,か,き,く,け,こ,さ,し,す,せ,そ,な,に,ぬ,ね,の,は,ひ,ふ,へ,ほ,ま,
    泉,隣,豆,条,荷,級,税,否,脳,統,弟,億,岩,康,板,模,暖,背,境,街,油,建,短,罪,衛,階,与,誌,胸,汚,暴,株,
    掛,労,筋,納,補,簡,江,造,浮,麗,秋,鼻,洋,就,施,弾,鬼,各,恥,抱,倍,渋,沖,五,略,算,寺,姿,伊,惑,志,票,
    適,森,片,独,雅,萌,夕,弱,並,混,積,囲,裏,講,席,退,妹,端,察,菜,児,史,染,賞,瞬,芸,額,究,軍,刻,鳥,舞,
    異,祭,授,仙,挙,印,夏,破,鉄,盛,紹,攻,鹿,極,暇,大,涙,押,図,源,類,漫,症,悲,側,整,甘,粉,担,索,稿,司,
    玉,星,奴,香,救,脱,弁,警,恐,両,具,辛,護,桜,丸,猫,卒,途,娘,池,省,製,禁,専,替,渡,庫,奈,八,袋,駄,険,
    協,案,枝,乳,許,象,処,迎,策,錬,給,働,証,枚,姉,管,査,血,比,官,静,喜,息,精,評,是,橋,緊,昔,辺,四,根,
    接,旅,武,迷,逆,門,詳,振,催,勢,困,吉,勤,守,路,怒,父,展,便,貴,佐,津,壊,韓,隊,答,吹,洗,移,研,域,輩,
    謝,客,河,倒,毛,充,販,改,提,師,頼,危,装,換,族,激,紙,銀,費,編,種,効,防,軽,節,修,御,医,材,逃,派,薬,
    越,遠,営,党,火,載,午,求,殺,徐,去,等,戸,健,府,況,企,撮,吸,率,邪,崎,響,差,為,誕,雑,凄,例,低,浜,撃,
    英,届,戻,松,程,形,勉,規,末,南,寄,申,室,冷,巻,共,宿,走,工,王,十,商,細,首,似,仲,探,任,権,識,示,突,
    郎,熱,園,髪,判,収,基,肉,型,談,減,光,打,兄,追,若,停,負,介,存,器,周,服,雨,訳,術,波,深,準,余,科,抜,
    影,赤,育,頃,値,焼,視,職,総,済,際,段,交,横,温,頂,習,助,布,絡,酒,係,茶,士,割,藤,婚,役,眼,離,青,呂,
    命,降,黒,絵,苦,阪,価,飛,区,系,局,村,城,務,備,井,携,昼,登,恋,興,満,義,避,館,版,我,千,失,沢,敵,居,
    号,設,氏,単,増,射,聴,幸,嬉,古,座,量,置,断,了,容,病,論,進,由,募,谷,母,岡,資,団,注,歳,春,住,故,米,
    飯,魔,構,拡,西,念,忘,非,普,説,害,個,帯,宮,投,怖,曜,馬,広,果,歩,駅,町,質,告,腹,希,院,件,遊,描,宅,
    速,字,太,像,態,他,親,得,反,超,験,演,土,消,爆,慣,嫌,雪,和,録,検,認,指,供,泣,石,試,彼,遅,治,復,呼,
    痛,有,皆,保,残,約,状,毎,観,伝,常,優,急,転,木,映,台,緒,格,乗,更,利,花,寒,完,議,制,計,組,曲,支,君,
    限,止,空,写,北,別,覚,散,引,万,政,丈,産,口,運,援,欲,半,疲,重,返,平,夢,望,在,久,声,絶,点,頭,参,勝,
    次,色,主,飲,素,加,選,音,向,流,川,直,込,落,式,眠,身,界,死,特,僕,海,調,難,配,足,週,必,然,歌,葉,都,
    問,位,教,休,線,題,表,法,戦,語,校,過,県,受,解,員,正,続,三,夫,顔,友,想,記,福,第,応,民,決,経,誰,被,
    連,天,神,島,道,二,達,立,世,切,読,始,文,頑,屋,数,侍,悪,着,信,集,男,品,昨,機,成,化,要,願,能,確,活,
    安,震,山,美,情,可,市,違,京,水,考,風,代,予,売,野,関,以,災,少,相,取,真,元,車,白,店,夜,番,公,現,強,
    心,先,田,使,仕,付,外,社,対,帰,近,放,不,送,内,書,小,張,面,同,多,料,終,早,所,初,結,円,起,朝,期,雷,
    当,力,変,理,度,的,場,良,開,部,物,原,実,様,体,通,報,金,買,家,味,長,持,性,愛,用,意,繰り返し,聞,俺,業,名,
    発,無,手,来,新,月,全,地,最,電,明,楽,合,感,目,食,話,作,動,寝,東,定,好,後,女,知,下,回,高,者,画,薄,
    年,思,捕,行,本,学,言,国,中,分,日,人,今,折,見,気,出,一,時,燃,生,間,笑,子,方,自,会,前,私,何,上,入,
    sizurusFonts_end = -99999999,
};

class SKFont{
    SKFont();
    SKFont(const SKFont&);
    ~SKFont();
public:
    static void drawString_toWindow(const SizurusFontsName drawFont, const GMRect2D& destRect, GMSpriteBatch* s, GMColor c = GMColor::White);
    // 文字列から、静流フォント配列にコンバートして返す。配列には、予め256バイトくらい用意しとこうよ。
    // 日本語以外はバグるんるん 第二引数は、濁点つけるかどうか。
    static void convertChar2Name(SizurusFontsName* fontNames, ten_flags* flags, const std::string& str);
 
    // 一文字のみを描画する。
    // 自由回転、自由拡縮、カラー指定描画が可能。時空亜空の言葉のために、追加したメソッド。
    static void drawCharacter(const char* character, GMSpriteBatch* s, const GMRect2D& destRect, const GMColor& color, double rotation, const GMVector2D& origin);
};

}